Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Building
The Building class represents the building filter expression.

Tekla.Structures.Filtering.Categories.LogicalAreaFilterExpressions.Building.#ctor
Initializes a new instance of the Building class.